Tekla Open API Reference for Tekla Structures 2025
DatabaseObject Properties
The DatabaseObject type exposes the following members.
Properties
Name | Description
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
Top
See Also
Reference
DatabaseObject Class
Tekla.Structures.Drawing Namespace